package com.itcast.oa.base.exception;

/**
 * 统一的错误编码表 
 */
public enum EErrorCode {
	F716001_71600101("71600101","请指定有效的商户号"),
	F716001_71600102("71600102","上传的商户流水不能为空"),
	F716001_71600103("71600103","第[%d]行的商户业务流水号不能为空"),
	F716001_71600104("71600104","第[%d]行的交易流水号不能为空"),
	F716001_71600105("71600105","第[%d]行的交易时间不能为空"),
	F716001_71600106("71600106","第[%d]行的交易方向不能为空"),
	F716001_71600107("71600107","第[%d]行的交易金额不能为空"),
/*	F716001_71600108("71600108","第[%d]行的商户编号不能为空"),
	F716001_71600109("71600109","第[%d]行的商户编号非当前结算对账商户"),*/
	F716001_71600110("71600110","我方交易单号[%s]已结算，不能重复结算"), 
	/*-----------代金券相关错误编码  start------------------*/
	F711019_711001901("711001901","无效的支付账户识别码"),
	F711019_711001902("711001902","无效的套餐信息"),
	F711019_711001903("711001903","代金券数量不能小于等于0"),
	F711019_711001904("711001904","代金券类型不能为空"),
	F711019_711001905("711001905","代金券面额不能小于等于0"),
	F711019_711001906("711001906","代金券名称不能为空"),
	F711019_711001907("711001907","代金券生效时间不能为空"),
	F711019_711001908("711001908","代金券失效时间不能为空"),
	F711019_711001909("711001909","生效时间不能大于失效时间"),
	F711020_711002001("711002001","无效的支付账户识别码"),
	F711021_711002101("711002101","无效的支付账户识别码"),
	F711021_711002102("711002102","代金券编号不能为空"),
	F711022_711002201("711002201","无效的支付账户识别码"),
	/*-----------代金券相关错误编码  end--------------------*/
	; 
	
	EErrorCode(String errCode,String errorMsg){
		this.errCode=errCode;
		this.errorMsg=errorMsg;
	} 
	
	private final String errCode;
	private final String errorMsg;
	
	public String getErrCode() {
		return errCode;
	}
	public String getErrorMsg() {
		return errorMsg;
	}
}
